Enables Reveal Hidden elements mode.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public void EnableRevealHiddenMode()
  Visual Basic
Public Sub EnableRevealHiddenMode
  Visual C++
public:
void EnableRevealHiddenMode()
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions InvalidOperationException   |   View cannot use temporary visibility modes.
 See Also
  View Class
  Autodesk.Revit.DB Namespace